ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_040_076.h
/** \brief GPIO_040_076 register offsets definitions */
#define GPIO_040_076_GPIO_040_PIN_CONTROL_OFFSET (0x00)         /**< (GPIO_040_076_GPIO_040_PIN_CONTROL) GPIO040 Pin Control Offset */
#define GPIO_040_076_GPIO_042_PIN_CONTROL_OFFSET (0x08)         /**< (GPIO_040_076_GPIO_042_PIN_CONTROL) GPIO 042 Pin Control Offset */
#define GPIO_040_076_GPIO_043_PIN_CONTROL_OFFSET (0x0C)         /**< (GPIO_040_076_GPIO_043_PIN_CONTROL) GPIO 043 Pin Control Offset */
#define GPIO_040_076_GPIO_044_PIN_CONTROL_OFFSET (0x10)         /**< (GPIO_040_076_GPIO_044_PIN_CONTROL) GPIO 044 Pin Control Offset */
#define GPIO_040_076_GPIO_045_PIN_CONTROL_OFFSET (0x14)         /**< (GPIO_040_076_GPIO_045_PIN_CONTROL) GPIO 045 Pin Control Offset */
#define GPIO_040_076_GPIO_046_PIN_CONTROL_OFFSET (0x18)         /**< (GPIO_040_076_GPIO_046_PIN_CONTROL) GPIO 046 Pin Control Offset */
#define GPIO_040_076_GPIO_047_PIN_CONTROL_OFFSET (0x1C)         /**< (GPIO_040_076_GPIO_047_PIN_CONTROL) GPIO 047 Pin Control Offset */
#define GPIO_040_076_GPIO_050_PIN_CONTROL_OFFSET (0x20)         /**< (GPIO_040_076_GPIO_050_PIN_CONTROL) GPIO 050 Pin Control Offset */
#define GPIO_040_076_GPIO_051_PIN_CONTROL_OFFSET (0x24)         /**< (GPIO_040_076_GPIO_051_PIN_CONTROL) GPIO 051 Pin Control Offset */
#define GPIO_040_076_GPIO_052_PIN_CONTROL_OFFSET (0x28)         /**< (GPIO_040_076_GPIO_052_PIN_CONTROL) GPIO 052 Pin Control Offset */
#define GPIO_040_076_GPIO_053_PIN_CONTROL_OFFSET (0x2C)         /**< (GPIO_040_076_GPIO_053_PIN_CONTROL) GPIO 053 Pin Control Offset */
#define GPIO_040_076_GPIO_054_PIN_CONTROL_OFFSET (0x30)         /**< (GPIO_040_076_GPIO_054_PIN_CONTROL) GPIO 054 Pin Control Offset */
#define GPIO_040_076_GPIO_055_PIN_CONTROL_OFFSET (0x34)         /**< (GPIO_040_076_GPIO_055_PIN_CONTROL) GPIO 055 Pin Control Offset */
#define GPIO_040_076_GPIO_056_PIN_CONTROL_OFFSET (0x38)         /**< (GPIO_040_076_GPIO_056_PIN_CONTROL) GPIO 056 Pin Control Offset */
#define GPIO_040_076_GPIO_057_PIN_CONTROL_OFFSET (0x3C)         /**< (GPIO_040_076_GPIO_057_PIN_CONTROL) GPIO 057 Pin Control Offset */
#define GPIO_040_076_GPIO_060_PIN_CONTROL_OFFSET (0x40)         /**< (GPIO_040_076_GPIO_060_PIN_CONTROL) GPIO 060 Pin Control Offset */
#define GPIO_040_076_GPIO_061_PIN_CONTROL_OFFSET (0x44)         /**< (GPIO_040_076_GPIO_061_PIN_CONTROL) GPIO 061 Pin Control Offset */
#define GPIO_040_076_GPIO_062_PIN_CONTROL_OFFSET (0x48)         /**< (GPIO_040_076_GPIO_062_PIN_CONTROL) GPIO 062 Pin Control Offset */
#define GPIO_040_076_GPIO_063_PIN_CONTROL_OFFSET (0x4C)         /**< (GPIO_040_076_GPIO_063_PIN_CONTROL) GPIO 063 Pin Control Offset */
#define GPIO_040_076_GPIO_064_PIN_CONTROL_OFFSET (0x50)         /**< (GPIO_040_076_GPIO_064_PIN_CONTROL) GPIO 064 Pin Control Offset */
#define GPIO_040_076_GPIO_065_PIN_CONTROL_OFFSET (0x54)         /**< (GPIO_040_076_GPIO_065_PIN_CONTROL) GPIO 065 Pin Control Offset */
#define GPIO_040_076_GPIO_066_PIN_CONTROL_OFFSET (0x58)         /**< (GPIO_040_076_GPIO_066_PIN_CONTROL) GPIO 066 Pin Control Offset */
#define GPIO_040_076_GPIO_067_PIN_CONTROL_OFFSET (0x5C)         /**< (GPIO_040_076_GPIO_067_PIN_CONTROL) GPIO 067 Pin Control Offset */
#define GPIO_040_076_GPIO_070_PIN_CONTROL_OFFSET (0x60)         /**< (GPIO_040_076_GPIO_070_PIN_CONTROL) GPIO 070 Pin Control Offset */
#define GPIO_040_076_GPIO_071_PIN_CONTROL_OFFSET (0x64)         /**< (GPIO_040_076_GPIO_071_PIN_CONTROL) GPIO 071 Pin Control Offset */
#define GPIO_040_076_GPIO_072_PIN_CONTROL_OFFSET (0x68)         /**< (GPIO_040_076_GPIO_072_PIN_CONTROL) GPIO 072 Pin Control Offset */
#define GPIO_040_076_GPIO_073_PIN_CONTROL_OFFSET (0x6C)         /**< (GPIO_040_076_GPIO_073_PIN_CONTROL) GPIO 073 Pin Control Offset */
#define GPIO_040_076_GPIO_074_PIN_CONTROL_OFFSET (0x70)         /**< (GPIO_040_076_GPIO_074_PIN_CONTROL) GPIO 074 Pin Control Offset */
#define GPIO_040_076_GPIO_075_PIN_CONTROL_OFFSET (0x74)         /**< (GPIO_040_076_GPIO_075_PIN_CONTROL) GPIO 075 Pin Control Offset */
#define GPIO_040_076_GPIO_076_PIN_CONTROL_OFFSET (0x78)         /**< (GPIO_040_076_GPIO_076_PIN_CONTROL) GPIO 076 Pin Control Offset */

/** \brief GPIO_040_076 register API structure */
typedef struct
{  /* GPIO 040:076 Pin Control Registers */
  __IO  __GPIO_040_076_GPIO_040_PIN_CONTROL_bits_t GPIO_040_PIN_CONTROL; /**< Offset: 0x00 (R/W  32) GPIO040 Pin Control */
  __IO  __GPIO_040_076_GPIO_042_PIN_CONTROL_bits_t GPIO_042_PIN_CONTROL; /**< Offset: 0x08 (R/W  32) GPIO 042 Pin Control */
  __IO  __GPIO_040_076_GPIO_043_PIN_CONTROL_bits_t GPIO_043_PIN_CONTROL; /**< Offset: 0x0C (R/W  32) GPIO 043 Pin Control */
  __IO  __GPIO_040_076_GPIO_044_PIN_CONTROL_bits_t GPIO_044_PIN_CONTROL; /**< Offset: 0x10 (R/W  32) GPIO 044 Pin Control */
  __IO  __GPIO_040_076_GPIO_045_PIN_CONTROL_bits_t GPIO_045_PIN_CONTROL; /**< Offset: 0x14 (R/W  32) GPIO 045 Pin Control */
  __IO  __GPIO_040_076_GPIO_046_PIN_CONTROL_bits_t GPIO_046_PIN_CONTROL; /**< Offset: 0x18 (R/W  32) GPIO 046 Pin Control */
  __IO  __GPIO_040_076_GPIO_047_PIN_CONTROL_bits_t GPIO_047_PIN_CONTROL; /**< Offset: 0x1C (R/W  32) GPIO 047 Pin Control */
  __IO  __GPIO_040_076_GPIO_050_PIN_CONTROL_bits_t GPIO_050_PIN_CONTROL; /**< Offset: 0x20 (R/W  32) GPIO 050 Pin Control */
  __IO  __GPIO_040_076_GPIO_051_PIN_CONTROL_bits_t GPIO_051_PIN_CONTROL; /**< Offset: 0x24 (R/W  32) GPIO 051 Pin Control */
  __IO  __GPIO_040_076_GPIO_052_PIN_CONTROL_bits_t GPIO_052_PIN_CONTROL; /**< Offset: 0x28 (R/W  32) GPIO 052 Pin Control */
  __IO  __GPIO_040_076_GPIO_053_PIN_CONTROL_bits_t GPIO_053_PIN_CONTROL; /**< Offset: 0x2C (R/W  32) GPIO 053 Pin Control */
  __IO  __GPIO_040_076_GPIO_054_PIN_CONTROL_bits_t GPIO_054_PIN_CONTROL; /**< Offset: 0x30 (R/W  32) GPIO 054 Pin Control */
  __IO  __GPIO_040_076_GPIO_055_PIN_CONTROL_bits_t GPIO_055_PIN_CONTROL; /**< Offset: 0x34 (R/W  32) GPIO 055 Pin Control */
  __IO  __GPIO_040_076_GPIO_056_PIN_CONTROL_bits_t GPIO_056_PIN_CONTROL; /**< Offset: 0x38 (R/W  32) GPIO 056 Pin Control */
  __IO  __GPIO_040_076_GPIO_057_PIN_CONTROL_bits_t GPIO_057_PIN_CONTROL; /**< Offset: 0x3C (R/W  32) GPIO 057 Pin Control */
  __IO  __GPIO_040_076_GPIO_060_PIN_CONTROL_bits_t GPIO_060_PIN_CONTROL; /**< Offset: 0x40 (R/W  32) GPIO 060 Pin Control */
  __IO  __GPIO_040_076_GPIO_061_PIN_CONTROL_bits_t GPIO_061_PIN_CONTROL; /**< Offset: 0x44 (R/W  32) GPIO 061 Pin Control */
  __IO  __GPIO_040_076_GPIO_062_PIN_CONTROL_bits_t GPIO_062_PIN_CONTROL; /**< Offset: 0x48 (R/W  32) GPIO 062 Pin Control */
  __IO  __GPIO_040_076_GPIO_063_PIN_CONTROL_bits_t GPIO_063_PIN_CONTROL; /**< Offset: 0x4C (R/W  32) GPIO 063 Pin Control */
  __IO  __GPIO_040_076_GPIO_064_PIN_CONTROL_bits_t GPIO_064_PIN_CONTROL; /**< Offset: 0x50 (R/W  32) GPIO 064 Pin Control */
  __IO  __GPIO_040_076_GPIO_065_PIN_CONTROL_bits_t GPIO_065_PIN_CONTROL; /**< Offset: 0x54 (R/W  32) GPIO 065 Pin Control */
  __IO  __GPIO_040_076_GPIO_066_PIN_CONTROL_bits_t GPIO_066_PIN_CONTROL; /**< Offset: 0x58 (R/W  32) GPIO 066 Pin Control */
  __IO  __GPIO_040_076_GPIO_067_PIN_CONTROL_bits_t GPIO_067_PIN_CONTROL; /**< Offset: 0x5C (R/W  32) GPIO 067 Pin Control */
  __IO  __GPIO_040_076_GPIO_070_PIN_CONTROL_bits_t GPIO_070_PIN_CONTROL; /**< Offset: 0x60 (R/W  32) GPIO 070 Pin Control */
  __IO  __GPIO_040_076_GPIO_071_PIN_CONTROL_bits_t GPIO_071_PIN_CONTROL; /**< Offset: 0x64 (R/W  32) GPIO 071 Pin Control */
  __IO  __GPIO_040_076_GPIO_072_PIN_CONTROL_bits_t GPIO_072_PIN_CONTROL; /**< Offset: 0x68 (R/W  32) GPIO 072 Pin Control */
  __IO  __GPIO_040_076_GPIO_073_PIN_CONTROL_bits_t GPIO_073_PIN_CONTROL; /**< Offset: 0x6C (R/W  32) GPIO 073 Pin Control */
  __IO  __GPIO_040_076_GPIO_074_PIN_CONTROL_bits_t GPIO_074_PIN_CONTROL; /**< Offset: 0x70 (R/W  32) GPIO 074 Pin Control */
  __IO  __GPIO_040_076_GPIO_075_PIN_CONTROL_bits_t GPIO_075_PIN_CONTROL; /**< Offset: 0x74 (R/W  32) GPIO 075 Pin Control */
  __IO  __GPIO_040_076_GPIO_076_PIN_CONTROL_bits_t GPIO_076_PIN_CONTROL; /**< Offset: 0x78 (R/W  32) GPIO 076 Pin Control */
} gpio040076_registers_t;
/** @}  end of GPIO 040:076 Pin Control Registers */

#endif /* _PIC32CX_0525SG12_GPIO_040_076_COMPONENT_H_ */
